[
  {
    "location": "SW17",
    "review": "Luca was punctual, tidy and polite.  He explained everything very clearly, and completed the work agreed quickly.  I would definitely recommend his services."
  },
  {
    "location": "SW17",
    "review": "Luca turned up as planned, was well prepared for the job and completed it quickly, safely and efficiently"
  },
  {
    "location": "SW16",
    "review": "Great job , professional friendly precise and always on time .  I highly recommend this place .  Thank you ."
  },
  {
    "location": "SE15",
    "review": "I recently had the pleasure of working with Luca from \"The One Electrician LTD,\" and I cannot express how impressed I am with the level of service I received.  From the very beginning, Luca and his team proved to be punctual and reliable.  Luca's protege, who was sent in to change my light fixture, was equally impressive.  The work was done efficiently, and the attention to detail was evident.  If you're in need of an electrician who not only gets the job done but goes above and beyond to ensure client satisfaction, look no further."
  },
  {
    "location": "SE23",
    "review": "Luca and Ronald did a super job in very quick time to replace a faulty hob with a second-hand one.  They were very informative of the whole process, explained what would be difficult and what would be easy.  They were polite and tidy in their work.  Nice guys too!"
  },
  {
    "location": "SE23",
    "review": "Working with The One Electrician was a pleasure from start to finish.  Organising the work was very efficient and the visit took place within a week of first contact.  The electrician that visited was extremely kind, respectful and polite.  His quality of work was excellent and we’re so pleased with our new lights.  Thanks again, we will certainly be using The One Electrician again."
  },
  {
    "location": "SE15",
    "review": "Super speedy, honest and efficient!"
  },
  {
    "location": "SW17",
    "review": "Absolutely fantastic job by Luca and his team.  He came over for an initial survey of my kitchen as all my appliances were tripping.  Found the problem within an hour and explained to me in detail what the problems were and how they could be fixed.  He came today to do the job and I couldn’t be happier!  He’s given me peace of mind that my electrics are safe and properly wired.  Would recommend to anyone!"
  },
  {
    "location": "KT11",
    "review": "Advice on wiring, PAT testing, Inspection report.  Always excellent to deal with"
  },
  {
    "location": "SW17",
    "review": "Luca and team were very responsive, managed to get the job completed a week from me reaching out.  The work was carried out to a high standard"
  },
  {
    "location": "CR0",
    "review": "Amazing service by the one electrician very professional and got the job done quickly, I would highly recommend to use their services you will not be disappointed"
  },
  {
    "location": "BR2",
    "review": "Luca and Ronald were very professional and resolved the fault in our kitchen circuit.  They were efficient with their time to reduce my bill.  I would Highly recommend them."
  },
  {
    "location": "SW2",
    "review": "I had a blown fuse and no lighting in my flat.  I messaged Luca who responded immediately and arranged to come later that day.  He replaced the fuse and also found the short circuit which had blown the fuse and fixed the issue in that socket.  Luca was great at explaining the issue and was professional in the work carried out.  Any future electrical problems he will be the first person I call"
  },
  {
    "location": "SW2",
    "review": "Luca and his team were really professional, they completed the works and more.  Really appreciate them doing that bit extra on the job.  Would recommend!"
  },
  {
    "location": "SE16",
    "review": "Luca and his team were punctual, friendly, tidy and provided a great quote for us on updating the LED down light fixtures throughout our flat - would recommend them to anyone needing electrician services."
  },
  {
    "location": "SW17",
    "review": "Luca and his colleague did a great job of moving my light switch to a more accessible area with minimal damage to the wall and cleaning up as they went along.  Very happy with the final result."
  },
  {
    "location": "SE15",
    "review": "Luca came out promptly and delivered the report.  He is very friendly, gives advice and takes care of the job.  Would use again."
  },
  {
    "location": "SW17",
    "review": "Fixed the fault and future proofed the kitchen"
  },
  {
    "location": "SW17",
    "review": "Luca was great.  Came round immediately and did the job in no time at all.  Fair price, quick, tidy work and lovely guy.  Would recommend."
  },
  {
    "location": "BH8",
    "review": "Luca was fantastic from start to finish.  He gave good advice and got the job done so quickly.  He also gave good recommendations and we will definitely be using him again.  Thank you so much"
  },
  {
    "location": "SE4",
    "review": "Excellent work - very pleased with level of service received."
  },
  {
    "location": "SE20",
    "review": "Luca responded quickly to all messages and was very polite at all stages.  He completed the job within days and sent a comprehensive report.  Would happily recommend"
  },
  {
    "location": "SW16",
    "review": "Luca was friendly, professional and punctual.  He was very responsive/flexible when I tried to book in a time last minute and the certificate was promptly provided within 2 days."
  },
  {
    "location": "CR4",
    "review": "Arrived as promised.  Evaluated the job and gave the estimates before commencing on the work.  Did a thorough and professional job.  Excellent work."
  },
  {
    "location": "SW4",
    "review": "Luca was polite and courteous - came to replace a faulty kitchen ceiling light worth a new now which made the tenants happy.  The previous light was constantly flickering:\n\nLuca was professional and arranged a day and time that was suitable for the tenants.  Would highly recommend."
  },
  {
    "location": "SE16",
    "review": "Luca has been amazing and reassuring.  Came out for an emergency and then came back a couple weeks later to sort out rewiring.  Will definitely use him again.  Very kind and helpful."
  },
  {
    "location": "SE5",
    "review": "Excellent service!  Rapid communication and very flexible diary.  Very thorough yet efficient!  Thanks so much, would use again."
  },
  {
    "location": "NW10",
    "review": "Higly recommend company"
  },
  {
    "location": "WC2H",
    "review": "An excellent job.  Well done.  The operatives were very professional work was completed immediately pricing was fair for the job at hand would definitely recommend this electrician to anyone."
  },
  {
    "location": "CR0",
    "review": "Luca is fantastic, very honest transparent and punctual - he will be the first person I contact when it comes to electrical work.  Highly recommended"
  },
  {
    "location": "SE23",
    "review": "Communication was great, time keeping spot on, job done quickly and to standard.  Would recommend"
  },
  {
    "location": "SE23",
    "review": "Excellent standard of work from this company.  Good communication - transparent and reliable and nice people.  Thoroughly recommend."
  },
  {
    "location": "SW11",
    "review": "Very good"
  },
  {
    "location": "SE23",
    "review": "Luca was very responsive and came to our property within 24 hours of reaching out.  He was professional, fast and efficient.  He did a thorough job and we received our certificate within 1 day.  Highly recommend him."
  },
  {
    "location": "NW1",
    "review": "Luca and the team were incredibly professional, efficient and super friendly.  Will work with them again in the future ??"
  },
  {
    "location": "SW16",
    "review": "Excellent speedy service\nGood vibes all around from Luca!  Used him last year and will defo use him next year"
  },
  {
    "location": "SE1",
    "review": "Very good communication, quick reply, good job"
  },
  {
    "location": "SE4",
    "review": "Luca did a fantastic job for my wife and I.  We live in a Victorian house and needed all of our electrical work making safe and bringing up to regulations.  Luca was very communicative, did all the work quickly and efficiently, helped us understand the costs in a transparent manner and the most cost efficient and effective way possible.  Thank you Luca for everything!  Our old house now meets regulations and is certified for 5 years.  We will be using Luca for any electrical work we need doing in the future"
  },
  {
    "location": "TW5",
    "review": "Luca came out to investigate a fault on external flood light.  He is a genuinely nice guy who is honest and professional.  Whilst others turned the job down or requested cherry picker.  Luca came out to investigate the fault.  Found the fault and resolved it, he explained the pricing and works clearly.  I would highly recommend"
  },
  {
    "location": "SE24",
    "review": "Very prompt and responsive, and carried out the work efficiently.  Reasonably priced - would recommend!"
  },
  {
    "location": "SW19",
    "review": "Luca is great.  Completed the job quickly and at a good price.  Would use again"
  },
  {
    "location": "SW17",
    "review": "Thank you Luca for a fantastic job great service excellent communication throughout the Job I’ve even booked more jobs as I am so pleased with the service"
  },
  {
    "location": "SW19",
    "review": "Luca provided an excellent service - keeping me informed throughout.  Would use again"
  },
  {
    "location": "SW17",
    "review": "This is the 2nd Job they have done for me and I've been completely satisfied both times.  They are professional and punctual, when it comes to the work they focus on the task and ask you to verify if you are happy at the end.  I will be using them in future for all electrical work."
  },
  {
    "location": "SW6",
    "review": "Very helpful advice in advance.  Excellent work and very tidy finish.  All delivered as promised, with great communication before, during and after."
  },
  {
    "location": "SM1",
    "review": "Great, friendly service and advice"
  },
  {
    "location": "KT1",
    "review": "Luca did a fabulous job, very professional and efficient and talked me through everything so I fully understood the process.  Luca is a people person who respects his clients and I felt fully confident in the work he was completing.  I will now use Luca to do any future work required on my property and he came well recommended by all the neighbours on our WhatsApp group who had used him previously."
  },
  {
    "location": "HG2",
    "review": "Very efficient and reliable.  Luca is honest, very responsive and does his work to a really high standard.  Would 100% recommend"
  },
  {
    "location": "SW17",
    "review": "Following a breakdown in our fuse board, which saw us losing power for almost three days, Luca came promptly on a Monday morning, quickly identified and diagnosed the problem and restored power.  He and his colleague returned about a week later to replace the old fuse board and carry out a full inspection and EICR report.  We were very pleased with The One's professionalism and workmanship, and would recommend him wholeheartedly to anyone looking for electrical expertise of the highest quality."
  },
  {
    "location": "SW2",
    "review": "Luca and his team are brilliant.  This is the second time I’ve had a big job done by Luca after a full light circuit rewire.  He gave me an excellent price for the work carried out and stayed late into the evening to ensure it was finished in one day.  He also adapted when I wanted much more work done on the day than he had originally quoted for, and gave me a very good discount for the extra work.  10/10 would recommend to anyone."
  },
  {
    "location": "CR0",
    "review": "Work was alright no to hard and finish everything on time."
  },
  {
    "location": "N1",
    "review": "The electrician turned up an hour earlier than the set time of 11am.  He completed the job on time.  He is competant on extractor fans and other electrical issues"
  },
  {
    "location": "SW17",
    "review": "Hi Everyone, I have a barber shop, I had a problem with a short circuit in side my shop and I lost my power with my client inside.  I was in the middle of busy day and I was pray for an hope .  I called Luca The one Electrician LTD and in less the one hour is come in my commercial shop and I can't believe he sorted all out in les the one hour.  Is very good Luca as Electrician and he recce me to change the fuse board and do some electrical Maintenance more often.  Very clear to spike with him and he explained to me all from beginning to the end very interested he help me with m"
  },
  {
    "location": "SW17",
    "review": "Luca and his team were great, following an unsatisfactory EICR Luca replaced an old fuse box with a new one, provided the EIC certificate and we then were satisfactory on the EICR .  Really great work and would definitely use Luca again"
  },
  {
    "location": "SW17",
    "review": "Highly recommend great and friendly guy"
  },
  {
    "location": "SE4",
    "review": "Great work.  Fast and efficient."
  },
  {
    "location": "SW17",
    "review": "Luca and his team are great.  I’ve used Luca on a number of occasions when I’ve had problems with my lights.  He and his team are very trustworthy and reliable.  In this particular case, they replaced the faulty wiring in my hall way and installed a new fuse box.  They did a great job at getting it all done efficiently within one day.  Would highly recommend."
  },
  {
    "location": "SW17",
    "review": "Came around promptly and at the time promised.  Fixed the problem!"
  },
  {
    "location": "SW17",
    "review": "Luca was great, called him in the morning as my tenants reported the pull cord switch in the bathroom wasn't working.  He quoted me a replacement price, arranged directly with the tenants on when to attend and that same afternoon he replaced the switch.  Great service and communication, I'd definitely recommend."
  },
  {
    "location": "SW18",
    "review": "Excellent in every way!  Came out within 2 hours of my call.  Very professional, helpful and courteous!  Did a perfect job!"
  }
]
